[
"Thanks, everybody, for joining me for this short meeting.",
"What I wanted to do, today, was to go around the room and asked people to share what is their favorite animal and why.",
"Okay. My name is Heather and my favorite animal is a dog.",
"And the reason that it's my favorite animal, probably a lot of people's favorite animal, because dogs are such loving companions who are so very loyal.",
"And I feel like they seem to know when you need them to come snuggle by you.",
"They're very perceptive of your feelings and they want to please you.",
"And I don't think they're, well there are mean dogs, but overall most dogs are very lovable and only just want to please humans.",
"And so I would say dogs are my favorite animal.",
"I can go next.",
"So, my name Sara, and every once in a while, I actually reflect on a different animal and I feel like I connect with a different one.",
"But recently I've been thinking a lot about elephants, and I think elephants are really fascinating.",
"They represent, in the African culture, they are a symbol of strength and power.",
"And I also think they resemble wisdom.",
"So yeah, I just think it's interesting, because we don't get to see them that often.",
"Usually, the first thing I would think about, when I'm asked about my favorite animal, I would say a pet animal.",
"But yeah, I just find animals in the wild are also very fascinating, very interesting to explore and learn more about them.",
"Well, similar to Sara, I'd have to say maybe my favorite animal would be maybe giraffes, because I've always thought they look very, they were very unique.",
"And whenever I went to a zoo, or anything like that, I'd always look forward to seeing the giraffes.",
"So yeah, I'd say giraffe.",
"Maybe ten years ago, if you had asked me my favorite animal, I would have said the horse.",
"And they're pretty up there, still.",
"But we happened to get a donkey a couple of years ago, because a neighbor was getting a bit older and couldn't look after her anymore himself as easily.",
"So, she just came over the fence to our property instead, and he can still visit her.",
"But that's the first donkey I'd ever met, and I have to say: she's amazing!",
"So, now, I would say my favorite animal is donkeys.",
"They're kind of like a horse and a dog, in their personality.",
"And I have to say she is smarter than I am; I fully acknowledge that.",
"Donkeys are quite amazing."
]
